!
"
'
'd
'll
'm
're
's
've
,
-but
-pau-
-ray
.
..
19
:
;
</s>
<s>
<unk>
?
A
A.
A.M.
A.S.
AA
AAA
AB
ABC
AF
AIDS
AIRMAIL
AL
AMEX
ANA
APS
ASA
ASAP
ATM
ATMs
AW
AX-four
Aaah
Aarghhh
Abbey
Abe
Able
Aboriginal
About
Absolutely
Academy
Accident
According
Ack
Across
Actually
Adams
Additionally
Adelaide
Admission
Adrian
Adult
Affirmative
Africa
African-American
After
Afternoon
Age
Agency
Ah
Ah-An
Ahh
Air
Airline
Airlines
Airmail
Airport
Airways
Aisle
Akasaka
Aki
Akihabara
Akiko
Akio
Akira
Akiyama
Al
Ala
Alert
Alfa
All
Alligator
Allow
Almost
Aloha
Along
Alpha
Alright
Also
Alter
Although
Altogether
Always
Am
Amazon
America
America-anything
American
Americans
An
Anchorage
And
Anderson
Angeles
Ann
Anne
Annex
Another
Any
Anybody
Anyhow
Anyone
Anything
Anytime
Anyway
Anywhere
Aoki
Aoyama
Aozora
Appears
Apple
Apply
Appreciate
Appreciated
Approximately
April
Aramis
Arashiyama
Arch
Archibald
Arco
Are
Area
Aren't
Arizona
Arms
Around
Arrange
Arrest
Arrival
Arrive
Art
Art.
As
Ashi
Asia
Ask
Asparagus
Assistance
Assorted
Astor
At
Atlanta
Atlantic
Atom
Atsugi
Attention
Attractive
August
Australia
Australian
Australian-made
Austria
Authority
Automatic
Automobile
Autumn
Avenue
Avon
Award
Awesome
B
B's
B.
B.A.
B.C.
BA
BAGGAGE
BY
Babel
Back
Background
Bad
Bag
Baked
Baker
Ballantine
Baltimore
Baltimore-bound
Band-Aid
Band-Aids
Bandit
Bank
Barbara
Barnes
Baroness
Barrack
Baseball
Basically
Basquiat
Bath
Battery
Bay
Be
Beach
Beachwalk
Beast
Beat
Beautiful
Beauty
Because
Beef
Beer
Before
Beginning
Being
Benz
Berkeley
Berlin
Besides
Best
Beth
Better
Betty
Between
Beverage
Beverly
Beware
Bicycle
Big
Bill
Bird
Black
Blanc
Bleeding
Bless
Blimey
Blood
Blow-dry
Blue
Board
Boarding
Bob
Bobby
Bomb
Bon
Bond
Bonsai
Books
Bookshop
Booth
Bordeaux
Bose
Boston
Boston-bound
Botanic
Botanical
Both
Bought
Boulevard
Bourbon
Bowers
Bowl
Boy
Braddock
Brandy
Brantley
Brazil
Break
Breakfast
Breathtaking
Bridge
Brie
Brighton
Bring
Britain
Britannia
British
British-made
Broadway
Bromo
Bronx
Brooklyn
Brown
Bryant
Buckingham
Bud
Buddha
Buddhism
Buddhist
Buddy
Budweiser
Bugsy
Building
Bulls
Bureau
Burglar
Burgundy
Bus
Buses
Business
Businesspeople
But
Butler
Buy
By
Bye
Bye-Bye
Bye-bye
C
C-card
C.
CA
CD
CD's
CDS
CDs
CEO
CHEERS
COD
Cab
Cabs
Cafe
Cafeteria
Cairns
Cajun
Cal
Calais
California
Californian
Call
Calligraphers
Calm
Cambridge
Cameron
Can
Can't
Canada
Canadian
Canal
Cancel
Canon
Canterbury
Canyon
Capital
Captain
Car
Carbonation
Card
Care
Carey
Caribbean
Carl
Carmel
Carnegie
Carol
Carp
Carry
Cars
Carter
Cascade
Cash
Casual
Cat
Catch
Cathedral
Cathy
Cats
Caution
Cedar
Center
Centigrade
Central
Ceramic
Certainly
Certificate
Chablis
Chairman
Champagne
Chanel
Change
Channel
Charge
Charing
Charleston
Charlie
Chart
Check
Check-in
Check-out
Cheerio
Cheers
Cheese
Chef
Chelsea
Chemicals
Cherry
Cherry-viewing
Chess
Chester
Chevy
Chianti
Chiba
Chicago
Chicken
Chihiro
Children
Chilly
China
Chinatown
Chinese
Chocolate
Chopsticks
Chow
Christianity
Christmas
Chrysler
Chuo
Church
Cigars
Cincinnati
Circus
Citibank
Citroen
City
Civic
Claims
Clark
Claus
Clean
Cleaning
Clear
Clinic
Clinton
Cloisters
Close
Clothes
Club
Coach
Coast
Coaster
Coca-Cola
Coffee
Cohen
Coke
Cokes
Cola
Colada
Cole
Coleman
Collect
College
Collision
Cologne
Color
Colorado
Colored
Columbus
Come
Coming
Comment
Commission
Company
Compared
Compliments
Compulsory
Conducting
Confucius
Congrats
Congratulations
Consomme
Constitution
Consulate
Consultation
Consumer
Contact
Continental
Continental-type
Continue
Convention
Conversation
Convert
Cook
Cooked
Cool
Corn
Corner
Corporate
Corporation
Correct
Could
Couldn't
Councilors
County
Covent
Crane
Cream
Credit
Crook
Cross
Cruise
Cullen
Cultural
Culture
Cup
Curl
Currently
Customs
Cut
Cute
D
D.
D.C.
DJ
DVD
Daiichi
Daily
Daiquiris
Dallas
Damage
Damn
Daniel
Daniels
Darn
Darn-I
Daudet
Dave
Day
Daylight
Dead
Dealer
December
Deciding
Deck
Declaration
Deep
Deer
Definitely
Delayed
Delhi
Delicious
Delivery
Delta
Denver
Departing
Department
Departure
Departures
Des
Describe
Design
Desire
Desk
Desktop
Detectives
Detroit
Diamond
Diaz
Dick
Did
Didn't
Diego
Diet
Digestion
Dimagio's
Diners
Dinner
Direct
Directions
Disappear
Discount
Disney
Disneyland
Do
Doctor
Dodgers
Dodgers-Yankees
Does
Doesn't
Dog
Doing
Dollars
Dolls
Dom
Don't
Doors
Dorfler
Double
Double-o-three
Douglas
Dover
Down
Downtown
Dr.
Draft
Dragon
Dramamine
Draw
Dried
Drille
Drive
Driver
Drop
Drop-off
Drunks
Dry
Dublin
Due
Dunhill
Durham
During
Dutch
Duty
Duty-Free
Duty-free
Dye
E
E.
EL
ENGAGED
ES
ETA
EXIT
Each
Early
East
East-west
Easy
Eat
Eat-in
Eating
Ebert
Eddie
Edinburgh
Edo
Education
Eight
Eighty
Eighty-seven
Eiji
Eiko
Einstein
Either
El
Elastoplast
Electric
Electrical
Electronic
Electronics
Elementary
Elevator
Eleven
Elizabeth
Ellison
Embassy
Emergency
Emperor
Empire
End
Endo
Engineering
England
English
English-Japanese
English-speaker
English-speaking
Englishmen
Enjoy
Enough
Equinox
Er
Era
Erm
Err
Escort
Especially
Estate
Estee
Estimated
Eurail
Eurailpass
Europe
Eurostar
Evanston
Eve
Even
Evening
Every
Everybody
Everyday
Everyone
Everything
Exactly
Excellent
Except
Exchange
Excluding
Excuse
Exit
Expensive
Explain
Exploring
Export
Express
Exquisite
Extension
Extra
Ezaki
F
F.
Fabulous
Facing
Fairmont
Fall
Falling
Falls
Family
Fancy
Fantastic
Far
Farewell
Fasten
Fat
Fax
February
Feel
Feminine
Ferragamo
Festival
Fifteen
Fifth
Fifty
Fifty-something
Fifty-three
Fill
Fillmore
Final
Finally
Find
Fine
Finish
Finished
Finland
Fire
First
Fish
Fisherman
Fishermen
Fishing
Five
Fix
Flattery
Flier
Flight
Flore
Florida
Flynn
Folk
Folkestone
Follow
For
Ford
Foreign
Forest
Forget
Forgetting
Forgive
Fork
Fortunately
Forty
Forty-five
Forty-second
Forty-six
Forty-three
Forty-two
Forward
Found
Four
Fourteen
Fragile
France
Francis
Francisco
Frank
Frankfurt
Frankly
Free
Freeway
Freeze
French
French-English
Frequent
Fresh
Friday
Fried
Friend
From
Front
Frozen
Fry
Fuck
Fuji
Full
Funny
Fussa
G
G'day
G-O-R-O-H
GEOS
GP
GPs
GW
Gables
Galbraith
Galleria
Garcon
Garden
Gasoline
Gate
Gee
Gee-why
General
Generally
George
German
Germany
Get
Getty
Giant
Giants
Giddyyap
Gift
Gift-wrapping
Gifts
Gim
Gin
Ginger
Ginkgo
Ginny
Ginza
Give
Glad
Glasgow
Glass
Glossy
Glove
Go
God
Going
Gojo
Gokurosama
Gold
Golden
Golf
Good
Good-bye
Goodman
Gorgeous
Goro
Goroh
Gosh
Got
Gothic
Gourmet
Government
Goya
Grab
Grace
Graf
Graham
Grand
Gray
Great
Greece
Green
Greenhill
Greenwich
Greetings
Gregson
Grey
Greyhound
Grill
Grille
Grilled
Grindelwald
Ground
Group
Grous
Grovers
Gs
Guardia
Guards
Guess
Guide
Guild
Gun
Guns
H
H.
HBO
HELP
HP
Ha
Ha-ha
Had
Haircut
Hakone
Halekulani
Half
Hall
Halloween
Halt
Ham
Hamburger
Hampshire
Hand
Handle
Hands
Hang
Hanging
Happy
Harada
Hard
Hard-boiled
Harebrained
Harris
Harrods
Harry
Haruko
Harvard
Has
Hashimoto
Hasn't
Have
Haven't
Having
Hawaii
Hawaiian
Hayakawa
Hayakita
He
Head
Health
Health-Sports
Hear
Heat
Heineken
Hello
Help
Henry
Her
Here
Here-fill
Here-just
Hereford
Hermes
Hertford
Hertz
Hey
Hi
Highly
Highway
Hills
Hilton
Hirokawa
Hiroko
Hiroshi
Hiroshima
His
Hisae
Hit
Hiya
Hmm
Hmm-they
Hmmm
Hokkaido
Hold
Holiday
Holland
Hollywood
Home
Honda
Honda's
Hondas
Honestly
Honesty
Hong
Honolulu
Hooray
Hop
Hope
Horyuji
Hosokawa
Hospital
Hot
Hotel
Hound
House
Housekeeper
Housekeeping
Houses
Houston
Houston-bound
How
Howdy
However
Hudson
Huh
Huh-huh
Huh-uh
Human
Hundred
Hurry
Hush
Huston
Hyatt
Hyde
I
I'm
I-N-O-U-E
I-ninety
I.
IBM-compatible
ID
II
IS
ISO
Ice
Ichiro
If
Iijima
Ikebana
Ikeda
Illegal
Illustrated
Imai
Impossible
Impressionist
In
Inc.
Incidentally
Include
Including
Incorporated
Indeed
India
Indian
Indians
Indigestion
Industries
Industry
Inform
Information
Initial
Inland
Inn
Inoue
Insert
Inside
Instant
Instead
Institution
Insurance
Intercontinental
Interesting
Interior
International
Internet
Interstate
Into
Intravenously
Inventory
Ireland
Irish
Is
Ishin-denshin
Island
Isn't
Israel
It
It's
Ita
Italian
Italy
Item
Items
Ito
Itoh
JAL
JFK
JL
JR
JTB
Jack
Jane
January
Japan
Japanese
Japanese-English
Japanese-made
Japanese-speaker
Japanese-speakers
Japanese-speaking
Japanese-style
Jazz
Jean
Jeez
Jesus
Jim
Jimmy
Jinmayku
Jinmyaku
Jiro
John
Johnny
Johnson
Join
Joliet
Jomon
Jones
Joyce
Julia
July
Jun
Jun.
Junction
June
Jungfrau
Junko
Just
K
K-I-M-I-O
KA
KAY
KDD
KEEP
Kabuki
Kahala
Kalakaua
Kamakura
Kamei
Kansai
Kanto
Kaori
Karate
Karin
Kataoka
Kate
Kato
Katsuhiko
Kawada
Kawai
Kawakami
Kawaramachi-dori
Kawazu
Kay
Kayo
Kazuo
Keenan
Keep
Keiko
Keisuke
Kelly
Kempo
Ken
Kendo
Kenichi
Kenji
Kennedy
Kent
Kevin
Ki-Mu-Ra
Kida
Kids
Kimio
Kimono
Kimura
Kind
Kindly
Kinenbi
King
Kingdom
Kingsport
Kingston
Kir
Kitano
Klein
Knock
Know
Koba
Kobayakawa
Kobayashi
Kobe
Kodak
Kogure
Kogyo
Koji
Kondo
Kong
Korean
Krebs
Kumi
Kurio
Kurosawa
Kussii
Kyoko
Kyoto
Kyoto-eki
Kyoya
Kyushu
LA
LANE
LDW
LOT
LT
La
Labor
Ladies
Lady
Laguna
Lake
Lakes
Land
Landy
Large
Lark
Las
Last
Lately
Later
Latin
Lauder
Laundromat
Laundry
Laurent
Law
Lead
Leaded
League
Leave
Lee
Left
Legs
Lend
Lenny
Leroi
Les
Let
Levi
Li
Liability
Liberty
License
Lido
Lie
Lightly
Like
Limited
Limousine
Lincoln
Linda
Line
Lines
Listen
Little
Liverpool
Lobby
Local
Located
London
Long
Long-distance
Look
Looking
Looks
Lorraine
Los
Loss
Lost
Louis
Louvre
Love
Lovely
Low
Low-fat
Lowell
Lower
Lufthansa
Lunch
Luxembourg
Lying
M
M-A-R-I
M-A-T-S-U-I
M-I-Z-U-T-A
M-O-R-I
M.A.
M.S.
MARI
MIZUTA
Ma'am
Macbeth
Machiko
Machine-wash
Macy
Macy's
Madame
Made
Madison
Madrid
Maezaki
Magic
Magnificent
Mai
Maihama
Mail
Main
Mainly
Major
Make
Makoto
Malaysian
Mall
Man
Manager
Manchester
Manhattan
Manou
Mansfield
Many
Maple
Marble
March
Margarita
Marguerites
Mari
Maria
Marina
Marine
Mark
Market
Marlboro
Marlin
Marnie
Martin
Martini
Marty
Marvin
Mary
Masao
Mascone
Mashed
Mason
Master
MasterCard
Mat
Matsui
Matted
Maui
Maunakea
May
Maybe
Mayumi
McDonald
McGuire
Me
Me.
Meals
Measure
Medicine
Mediocre
Medium
Medium-rare
Meet
Meg
Meiji
Melbourne
Melon
Members
Memorial
Memphis
Men
Menu
Mercury
Merely
Merit
Merits
Metropolitan
Mexican
Mexico
Miami
Michael
Michelangelo
Michelob
Michiko
Mickey
Middle
Midori
Midorinomadoguchi
Midtown
Might
Migraine
Miho
Mike
Miki
Mikio
Milan
Milano
Mild
Milford
Milk
Miller
Millions
Milton
Minami
Mind
Mine
Minestrone
Miniskirts
Minneapolis
Minoru
Minto
Miroku
Miserables
Miss
Mister
Mita
Mitsuru
Miyanishi
Miyuki
Mizuta
Mme
Mmm
Mmm-hmm
Moana
Modern
Mohammed
Moines
Mom
Monday
Mondays
Monet
Money
Monica
Mont
Montezuma
Monthly
Montreal
Monument
Moore
More
Moreover
Mori
Morii
Morita
Morning
Morocco
Morro
Moscow
Moselle
Most
Mostly
Motoyama
Mount
Mountain
Mouse
Move
Mozart
Mr
Mr.
Mrs.
Ms
Ms.
Mt
Much
Murai
Museum
Musicals
Must
Mustang
Mustard
My
N
NBA
NO
NW
NYU
Nagano
Nagasaki
Nagashima
Nagoya
Nah
Nakai
Nakajima
Nakamura
Nakanuma
Nakayama
Name
Named
Nancy
Nanyo
Naomi
Napa
Nara
Narita
Nassau
National
Nations
Native
Naturally
Near
Nearest
Nearly
Neat
Need
Needles
Needless
Ness
Never
Nevertheless
New
Newark
Newburg
Newspapers
Next
Niagara
Nice
Nicholas
Night
Nighty
Nikko
Nikon
Nikonos
Nine
Ninety
Ninety-nine
Nippon
Nishihara
Nitta
No
No-one
No-smoking
No.
Nobel
Nobles
Nobody
Noguchi
Nomoto
Non
Non-existent
Non-smoking
None
Nonsmoking
Noon
Nope
Noriko
Normal
Normally
North
Northern
Northwest
Norway
Not
Note
Nothing
Notice
Notre-Dame
November
Now
Nowadays
Number
Nurse
Nuts
O
O-Bon
OK
OMEDETOUGOZAIMASU
OS
Oakland
Oatmeal
Obliged
Obon
Ocean
October
Oda
Of
Off
Off-peak
Office
Officer
Officers
Offices
Often
Ogawa
Ogihara
Oh
Oh-the
Ohki
Ohno
Oily
Oka
Okada
Okamoto
Okawa
Okay
Okey
Okinawa
Okuda
Okura
Olive
Ome
On
Once
One
One-way
One-zero-seven-zero
Onions
Only
Ono
Ooh
Oops
Oops-I
Open
Opera
Operator
Or
Orange
Orchestra
Orchid
Orders
Ordinarily
Origami
Orleans
Ormuz
Osaka
Ouch
Our
Out
Over
Overseas
Oxford
Ozawa
P
P.S.
PAA
PAI
PASSING
PEC
PG
PIN
PK
PM
PRI
Pacific
Pack
Paddington
Painkiller
Palace
Palladium
Pan
Pantheon
Paper
Papers
Parade
Pardon
Parents
Parfait
Paris
Park
Parker
Parks
Parliament
Part
Particularly
Party
Paso
Pass
Passport
Passports
Patrick
Paul's
Paulman
Pay
Payment
Peach
Peck
Penn
People
Pepper
Pepsi
Perfect
Perfume
Perhaps
Perignon
Period
Person
Person-to-person
Personal
Personally
Personnel
Perth
Perugino
Peters
Peterson
Phantom
Philadelphia
Phoenix
Phone
Photography
Photos
Phyllis
Picasso
Piccadilly
Pick
Pickled
Pickpocket
Picture
Pictures
Pier
Pilaf
Pimlico
Pina
Pink
Pizza
Place
Plainly
Plains
Plane
Planes
Plant
Plastic
Plate
Platform
Plaza
Pleasant
Please
Pleased
Pleasure
Plus
Plymouth
Point
Pole
Police
Port
Porter
Portland
Portugal
Possibly
Post
Powell
Practice
Prada
Precisely
Preferably
Premier
Premium
Presently
President
Press
Prestwick
Pretty
Printed
Prize
Probably
Proceed
Professor
Project
Protection
Provence
Public
Puccini
Pull
Pullman
Pump
Puppies
Purely
Purse
Purse-snatcher
Push
Put
Put'em
Putting
QLR
QUIET
Queen
Queens
Quesnay
Quick
Quickly
Quiet
Quit
Quite
R
R.
Rainbow
Raise
Ramen
Rare
Raw
Ray
Reaction
Read
Real
Really
Rebecca
Receipt
Recently
Reception
Recharge
Reconfirmation
Red
Reds
Reduce
Refer
Reform
Regarding
Regency
Regent
Registered
Regular
Regularly
Reiko
Relax
Remember
Remington
Rene
Rent
Rent-a-Car
Rent-a-car
Rental
Repeat
Report
Request
Reservation
Reservations
Reserve
Respect-for-the-Aged
Rest
Restaurant
Return
Revlon
Rice
Richard
Richards
Ride
Riders
Rie
Right
Right-o
Ring
Ringi
Ringisho
Risa
Ritz
River
Riverside
Road
Roast
Robber
Roberts
Robinson
Rock
Rockefeller
Rockhead
Rodin
Roger
Rogers
Roll
Roller
Rolling
Romaine
Rome
Ronsons
Roof
Room
Room-to-room
Rooms
Rose
Rosemarie
Roughly
Round
Row
Roy
Royal
Rugby
Rumi
Run
Running
Rushmore
Russell
Russia
Russian
Russian-style
Russo
Ryan's
Ryoanji
S
S-U-Z-U-K-I
S.
SATO
SE
SF
SFX
SMOKING
Sachiko
Sachiyo
Sacramento
Sad
Sadao
Sadly
Safety
Saigon
Saint
Saito
Sakai
Sakata
Saks
Salad
Sale
Sales
Salt
Sam
Samaritan
Same
Samsonite
Samuels
San
Santa
Sapporo
Sara
Sasaoka
Sato
Satomi
Saturday
Saturdays
Sauternes
Save
Saville
Saving
Savoy
Sawa
Say
Scala
Scampi
Schmidt
School
Scotch
Scotch-on-the-rocks
Scotland
Scottish
Scram
Scramble
Scrambled
Scuse
Sea
Seafood
Sears
Seaside
Seasons
Seat
Seats
Seattle
Second
Section
See
Seeing
Seems
Seiji
Seiko
Sellotape
Send
Sensitive
Separate
September
Series
Served
Service
Services
Set
Seto
Seven
Seventh
Seventy
Seventy-Second
Seventy-five
Seventy-nine
Seventy-two
Sex
Shaken
Shakespeare
Shall
Shame
Shampoo
Shane
Shanghai
Shangri-la
She
Shell
Sheraton
Sherry
Shiatsu
Shibazuke
Shibuya
Shigekiyo
Shigeko
Shikoku
Shimada
Shimpson
Shindo
Shinjuku
Shinkansen
Shino
Shinto
Shintoism
Ship
Shirane
Shirosawa
Shirts
Shit
Shodo
Shogatsu
Shop
Shopping
Shore
Shorten
Should
Shoulder
Shouldn't
Show
Showa
Shrimp
Shut
Shuttle
Sicily
Sick
Siddhartha
Side
Sigh
Sight-seeing
Sightseeing
Sign
Signature
Silence
Silkcut
Silkcuts
Similar
Simply
Simpson
Simpson's
Simpsons
Since
Singapore
Singing
Sir
Sirloin
Sit
Six
Sixteen
Sixty
Size
Skin
Skis
Skyway
Sleep
Sliced
Slot
Slow
Small
Smear
Smith
Smith's
Smiths
Smithsonian
Smoking
Sneakers
So
So-so
Soft-boiled
Soho
Sole
Some
Somebody
Someone
Someplace
Something
Sometimes
Somewhere
Soon
Sorry
Sort
Sounds
Soup
Sour
South
Soviet
Space
Spaghetti
Spain
Spanish
Spare
Speak
Speaking
Special
Spectacular
Spectrum
Speed
Spell
Spock
Spock's
Spread
Spread'em
Spring
Sprite
Sprouts
Square
St.
Stacey
Stadium
Stamps
Stand
Standing
Star
Starbucks
Stars
Start
Starting
State
States
Station
Station-Fast
Station-to-station
Statue
Stay
Steak
Stealing
Step
Stick'em
Still
Stock
Stomach
Stonehenge
Stoner
Stones
Stop
Store
Straight
Straight-up
Strawberry
Street
Streetcar
Streets
Student
Study
Studying
Style
Subtropicana
Suddenly
Sugako
Sugar
Sugita
Suit
Summit
Sumo
Sunday
Sundays
Super
Superb
Supplement
Sure
Surely
Susan
Sushi
Susie
Suzuki
Sweat
Sweden
Sweet
Swindler
Swiss
Swiss-made
Swissair
Switzerland
Sword
Sydney
T
T-A-N-A-K-A
T-bone
T-intersection
T-shirt
T-shirts
T-zone
T.
TANAKA
TCs
TIME
TV
TWA
Ta
Tab
Tabio
Table
Tachikawa
Tadashi
Tahiti
Taika
Takada
Takagi
Takahashi
Takai
Takano
Takao
Take
Take-out
Takeda
Takemi
Takeshi
Takeshita
Takeuchi
Taking
Talk
Tamura
Tanaka
Tango-no-sekku
Taniguchi
Tankyusha
Taro
Tasty
Tatsumi
Tax
Taxes
Taxi
Tea
Teach
Teacher
Teatro
Technology
Telephone
Tell
Temple
Ten
Ten-mark
Tennis
Terasawa
Terayama
Terminal
Terrace
Tetsuo
Thai
Thames
Than
Thane
Thank
Thankfully
Thanks
Thanksgiving
That
That's
The
Theater
Theft
Their
Then
There
These
They
Thief
Things
Think
Third
Thirteen
Thirteenth
Thirty
Thirty-eight
Thirty-five
Thirty-second
Thirty-six
This
Thomas
Thompson
Thomson
Those
Though
Thought
Thousand
Three
Three-two-one-two
Throw
Thunder
Thursday
Tickets
Ties
Tiffany's
Tiger
Tigers
Till
Time
Times
Timewise
Tin
Tirol
Titanic
To
Toast
Today
Toffler
Togo
Toilet
Tokens
Tokyo
Tom
Tomorrow
Tonight
Too
Top
Toronto
Tosca
Toshio
Totally
Touch
Tour
Touring
Tourist
Tourists
Tournaments
Tours
Towards
Tower
Towers
Track
Trade
Trafalgar
Transfer
Transit
Transylvania
Travel
Traveler
Traveling
Tri-X
Trim
Trinity
Truly
Try
Tsuneo
Tsurutaro
Tsutomu
Tube
Tucson
Tuesday
Tulip
Turkey
Turn
Twelve
Twenty
Twenty-eight
Twenty-five
Twenty-four
Twenty-seventh
Twin
Two
Two-one-oh
Tylenol
U
U.K.
U.S.
U.S.A.
UA
UFO
UK
UNACCOMPANIED
US
USA
UV
Ueda
Uehara
Ugh
Uh
Uh-ha
Uh-huh
Uh-oh
Uhh
Uhu
Ukiyoe
Um
Umm
Unbelievable
Uncarbonated
Unchilled
Uncle
Under
Underground
Understand
Understanding
Understood
Undo
Unfasten
Unfortunately
Ungaro
Union
United
Universal
University
Unlock
Until
Uozu
Up
Urm
Use
Using
Usually
V
V.
VACANCY
VACATION
VAT
VISA
Vacation
Valentino
Van
Vancouver
Vanilla
Various
Vegas
Vegetable
Venice
Verdi
Vernal
Very
Vichy
Victoria
Video
Vienna
Vietnamese
View
Village
Vince
Vincent
Visa
Visiting
Vitamin
Voice
Voila
Voyage
W
WC
WWW
Waimanalo
Wait
Waiter
Waitress
Waiver
Wake
Wake-up
Wales
Walk
Walker
Walking
Wall
Wallace
Walsh
Wani
Want
War
Wars
Warwick
Was
Wash
Washington
Wasn't
Watanabe
Watch
Water
Waterloo
Watson
Wave
Way
We
Web
Wednesday
Week
Welcome
Well
Well-done
Were
Weren't
West
Western
Western-style
Westerners
Westminster
Wharf
What
Whatever
Wheeler
When
Where
Whereabouts
Whew
Which
While
Whiskey
Whisky
Whitcomb
White
Who
Whole
Whom
Whose
Why
Wide
Wild
Will
William
Willow
Wilson
Wimbledon
Window
Windows
Windows-based
Windsor
Wine
Wishing
With
Without
Women
Won't
Wonderful
Woods
Words
Work
Working
World
Would
Wouldn't
Wow
Wrap
Write
Wrong
X
X-ray
Y
Yah
Yamada
Yamaguchi
Yamakawa
Yamamoto
Yamanote
Yamaoka
Yamashita
Yamato
Yankee
Yankees
Yeah
Year
Yeeeah
Yellow
Yelp
Yen
Yep
Yes
Yes-especially
Yesterday
Yikes
Yo
Yokan
Yoko
Yoko-san
Yokohama
Yoo
York
Yosemite
Yoshida
Yoshie
Yoshino
Yoshio
You
Young
Your
Yukata
Yuki
Yukiko
Yukio
Yuko
Yum
Yummy
Yup
Yusuke
Yves
Z
ZZZ
Zealand
Zen
Zero
Zoo
a
a.m.
abalone
abated
abc
abdomen
abdominal
ability
able
aboard
about
abouts
above
abrasion
abroad
absence
absent
absolute
absolutely
abundance
accelerator
accept
acceptable
accepted
accepts
access
accessible
accessories
accident
accidental
accidentally
accidents
accommodate
accommodation
accommodations
accompanied
accompany
accompanying
according
account
accountant
accounting
accounts
accurate
accuse
accustomed
ache
aches
aching
achy
acidy
acknowledge
acquaintance
acquainted
acquired
across
acrylic
act
acting
action
activate
active
activities
activity
actor
actors
actress
actual
actually
acute
ad
add
added
addendums
adding
addition
additional
address
addresses
adhesive
adjacent
adjust
adjustable
adjusted
adjusting
adjustment
administer
administration
admire
admired
admirer
admission
admitted
adorable
adult
adults
advance
advanced
advantage
advantageous
advantages
advertise
advertised
advertising
advice
advisable
advise
advised
aerogram
aerogrammes
affair
affairs
affect
affected
afflicted
afford
affordable
affordably
afraid
after
afternoon
afternoons
afterwards
again
against
age
aged
agencies
agency
agenda
agent
agents
ages
ago
agree
agreed
agreement
agrees
ahchoo
ahead
ahold
aid
aids
ailments
aim
aimlessly
ain't
air
air-conditioner
air-conditioning
air-mail
air-sickness
aircraft
airfare
airline
airlines
airmail
airplane
airplanes
airport
airports
airsick
airsickness
aisle
alarm
album
alcohol
alcoholic
ale
algae
alight
alive
all
all-day
all-night
alla
allergic
allergies
allergy
alligator
allow
allowance
allowed
allows
almost
alone
along
alongside
already
alright
also
alter
alteration
alterations
altered
alternate
alternative
altitude
altogether
always
am
amateur
amazing
ambulance
amend
american
among
amount
amounts
ample
amplifier
amusement
amusing
an
analgesic
analogue
ancestors
ancestry
anchovies
ancient
and
anemia
anesthetic
angel
angry
animals
ankle
anniversary
annotation
announce
announced
announcement
announcing
annoying
annual
annually
anodyne
another
answer
answered
answering
answers
anthropology
anti
antibiotics
antimagnetic
antique
antiques
any
anybody
anyhow
anymore
anyone
anyplace
anything
anytime
anyway
anywhere
apart
apartment
apartments
aperitif
aperitifs
apologies
apologize
apparently
appeal
appealing
appear
appearance
appeared
appearing
appears
appendectomy
appendicitis
appetite
appetizer
appetizers
applaud
apple
apples
appliances
applicable
application
applied
applies
apply
appointment
appointments
appraisal
appreciate
appreciated
appreciation
appreciative
approach
approached
approaching
appropriate
approval
approve
approximate
approximately
apron
aquarium
arch
archaeology
architect
architecture
are
area
areas
aren't
arguing
arm
arms
around
arrange
arranged
arrangement
arrangements
arranging
arrival
arrive
arrived
arrives
arriving
art
art.
article
articles
artifact
artificial
artist
artists
arts
arts.
as
ascertain
ashtray
ask
asked
asking
asks
asleep
aspects
aspirin
aspirins
assaulted
assemble
assembly
assignment
assist
assistance
assisting
associated
assorted
assortment
assure
asthma
at
ate
athlete
athletic
atmosphere
atomizer
attached
attack
attacked
attempt
attend
attendance
attendant
attendants
attending
attends
attention
attire
attractions
attractive
attributes
audience
audio
aunt
authentic
author
authored
authorities
auto
autograph
automated
automatic
automobile
autumn
aux
availabilities
availability
available
avant-garde
avenue
average
avoid
avoiding
awaiting
awaits
awake
award
aware
away
awe
awe-inspiring
awesome
awful
awfully
awning
baby
baby-sit
baby-sitter
babysitter
bacardi
back
backache
backed
background
backroll
backrub
backs
backward
backyard
bacon
bad
badly
baffled
bag
bagels
baggage
baggages
baggy
bags
bail
bait
baits
baked
bakery
balance
balcony
bald
ball
ball-boy
ball-point
ballet
ballpoint
balls
balm
bamboo
banana
band
band-aid
band-aids
bandage
bands
bangs
bank
banking
banks
banned
banquet
banquets
bar
barbed
barber
bard
barfing
bargain
barrette
bars
bartender
base
baseball
based
basement
bases
bashful
basic
basically
basis
basket
basketball
bass
bassinet
bath
bathe
bathing
bathrobe
bathroom
baths
bathtub
bathtubs
batteries
batters
battery
batting
battle
battles
be
beach
beach-front
beans
bear
beard
bearish
beat
beating
beats
beautiful
beauty
became
because
become
becomes
becoming
bed
bed-rest
bedridden
beds
bee
beef
beefsteak
been
beer
beers
before
beforehand
befriend
beg
beggar
begin
beginner
beginners
beginning
begins
begun
behalf
behind
being
believe
bell
bellboy
bellhop
bellman
belly
belong
belonging
belongings
belongs
below
belt
bend
beneficial
bent
bereaved
berth
berths
beside
besides
best
best-known
bet
better
between
beverage
beverages
beyond
bicycle
bicycles
big
bigger
biggest
bike
biker
bill
billed
billfold
billing
billion
billions
bills
bin
bind
binding
binoculars
bins
biographical
bird
birds
birthday
birthstone
biscuits
bit
bite
biting
bitten
bitter
bitterly
black
black-and-blue
blame
blank
blanket
blankets
blanks
blast
blazer
bleach
bleacher
bleachers
bleed
bleeding
bleeds
blemish
blemishes
blend
blends
bless
blind
blinds
blink
blinked
blinker
blinking
blister
blistered
blisters
blitz
block
blocked
blocked-up
blocks
blond
blood
bloodshot
bloody
bloom
blooming
blossom
blossoming
blossoms
blot
blouse
blouses
blow
blow-dry
blowdry
blowing
blown
blue
blues
blurry
board
boarded
boarding
boards
boat
boats
body
boil
boiled
boiler
boiling
bold
bolognese
bond
bone
bonito
bonuses
book
book-marks
booked
booking
booklet
books
bookshop
bookstore
boom
booming
boost
booster
boot
booth
boots
bore
boring
born
borrow
borrowing
boss
botanical
both
bother
bothered
bothering
bothers
bottle
bottles
bottom
bought
bouncer
bound
bountiful
bourbon
bout
boutique
boutiques
bowel
bowels
bowl
box
boxer
boxes
boy
boycott
boyfriend
boyfriends
boys
bracelet
braised
brake
brakes
branch
branches
brand
brand-new
brandies
brands
brandy
bread
break
breakable
breaker
breakfast
breakfasts
breaking
breaks
breast
breath
breathalyzer
breathe
breather
breathing
breathtaking
breed
bricks
bride-to-be
bridge
brief
brief-case
briefcase
briefly
brier
bright
brighter
brilliant
brim
bring
bringing
brings
briquets
broaches
broad
broader
brochure
brochures
broiled
broke
broken
brokerage
bronze
brooch
brother
brothers
brought
brown
brows
browse
browsing
bruise
bruised
bruises
bruising
brush
bubble
buck
bucket
buckle
bucks
budding
budget
buds
buffet
buggy
bugs
build
building
buildings
built
bulb
bulging
bulk
bulky
bulletin
bullish
bum
bummer
bump
bumped
bumps
bunch
bunker
bunny
bureau
burger
burglar
buried
burned
burning
burnt
burst
bursting
bus
buses
business
business-class
businessman
businessmen
businesspeople
businessperson
busses
busted
busy
but
butcher
butt
butter
butterfly
button
buttons
buy
buyer
buying
by
bye
cab
cabin
cabinet
cabins
cable
cablegram
cables
cabs
cafe
cafeteria
cage
cake
cakes
cal
calculate
calculated
calculating
calculation
calculations
calculator
calendar
call
called
calligraphy
calling
calls
calm
calorie
calories
calory
came
camelias
camera
cameras
camp
camper
camping
campsite
can
can't
cancel
canceled
cancellation
cancellations
cancelled
cancelling
candies
candy
canned
cannot
canoeing
cans
cap
capability
capable
capacity
capita
capital
cappuccino
capsule
capsules
captain
car
car-sick
carafe
carat
caravan
carbonated
carburetor
card
cards
care
carefree
careful
carefully
careless
carne
carnival
carousel
carpet
carriage
carried
carrier
carries
carrots
carry
carry-on
carry-ons
carrying
cars
cart
carte
carton
cartons
cartridge
carts
carwash
case
cases
cash
cashed
cashier
cashmere
casino
casinos
cassette
cast
casters
castle
casual
cat
catalog
catalogue
catch
catches
catching
categorically
cathedral
cats
catsup
caught
cause
caused
causes
causing
caution
cautiously
cavity
cd
ceiling
celebrate
celebrated
celebrates
celebration
cell
cellar
cellophane
cellular
cemetery
cent
center
centers
centimeter
centimeters
central
centre
cents
centuries
century
ceramic
ceramics
cereal
cereals
ceremonies
ceremony
certain
certainly
certificate
certificates
certification
certified
certifies
chain
chain-bracelet
chains
chair
chalet
chalk
challenge
champagne
champions
chance
chancy
change
changeable
changed
changes
changing
channel
channels
chapel
chapped
character
characteristic
characteristics
charcoal
charge
chargeable
charged
charges
charging
charity
charm
charmed
charming
chart
charter
charts
chased
chasing
chat
cheap
cheaper
cheapest
cheaply
cheated
check
check-in
check-ins
check-out
check-up
checked
checked-in
checking
checking-in
checkout
checks
cheddar
cheek
cheeks
cheese
cheeseburger
cheeseburgers
chef
chemist
chemists
cheques
cherries
cherry
cherry-viewing
chess
chest
chew
chewable
chewing
chews
chic
chicken
chief
child
childish
childlike
children
chili
chill
chilled
chills
chilly
chipped
chips
chiropractor
chitchat
chocolate
chocolate-chip
choice
choices
choose
choosing
choosy
chop
chopped
chops
chopsticks
chore
chowder
chronic
chronically
church
cigar
cigarette
cigarettes
cinema
cinematic
circle
circulate
circumference
circumstances
cities
citrus
city
city-bound
claim
clam
clap
clapping
clarifying
class
classes
classical
classifieds
classroom
classy
claws
clay
clean
cleaned
cleaner
cleaners
cleaning
cleansing
clear
clear-cut
clearance
cleared
clearing
clearly
clears
clerk
clerks
clever
click
client
clients
cliff
cliff-hanger
climate
climb
climbing
climbs
clinic
clinical
clip-ons
clips
cloak
cloakroom
clock
clocks
clogged
cloisonne
cloister
close
close-by
closeby
closed
closely
closer
closes
closest
closet
closing
cloth
clothes
clothespins
clothing
clouds
cloudy
clown
clowning
club
club-car
clubhouse
clubs
clue
clutch
co-worker
co-workers
coach
coarse
coast
coaster
coat
coatroom
coats
cocktail
cocktails
coconut
code
codfish
coexist
coffee
coffeehouse
coffeehouses
coffees
cognac
coin
coin-operated
coincidence
coincidental
coins
coke
cola
cold
colder
coldest
colds
coleslaw
collaboration
collapsed
collar
collars
colleague
colleagues
collect
collecting
collection
collections
collectively
collector
collectors
collects
college
collision
cologne
color
color-usage
colored
colorfast
colorful
coloring
colors
colour
coloured
colours
columns
comb
combat
combination
combine
combining
combs
come
comedy
comes
comfortable
comfortably
comic
coming
comma
commemorate
commemorative
comment
comments
commercial
commission
commodities
common
commonplace
communicate
communicating
communication
communications
commute
commuter
commuters
commutes
compact
companies
companion
company
company-worker
comparatively
compare
compartment
compartments
compatible
compensate
compensated
compensation
competent
competing
competition
competitive
competitors
complain
complaining
complaint
complementary
complete
completed
completely
completion
complex
complexion
compliment
complimentary
compliments
components
compose
composed
composition
comprehend
comprehension
comprehensive
compress
compromise
compulsory
computer
computers
con
concealer
conceived
concentration
concern
concerned
concerning
concerns
concert
concerts
concession
concierge
conclude
concludes
conclusion
concourse
concrete
condition
conditioned
conditioner
conditioning
conditions
condo
condolences
condominium
conduct
conducted
conducting
conductor
conducts
cone
conference
confidently
confined
confirm
confirmation
confirmed
confirming
confiscated
confused
congested
congratulate
congratulations
congratulatory
connect
connected
connecting
connection
connections
consciousness
consecutive
consensus
conservative
consider
considerable
considerably
considerate
considered
consist
consisting
consists
constable
constant
constantly
constipated
constipation
constitute
constitution
constricting
constructive
consulate
consult
consultation
consulted
consume
consumers
consuming
contact
contacted
contacting
contacts
contagious
contain
contained
container
containers
containing
contains
contamination
content
contents
contest
continental
continue
continued
continues
continuously
contraceptives
contract
contracted
contractions
contracts
contractual
contrast
contributed
control
contused
contusion
convenience
convenient
conveniently
convent
conversation
converse
conversing
convert
converted
convertible
convertibles
converting
convey
conveyor
cook
cooked
cooker
cookie
cookies
cooking
cool
cooled
cooler
cooling
cools
cooperation
copier
copies
copper
copy
coral
cord
core
corn
corner
cornfield
cornflakes
corporate
corps
correct
correctly
correspond
corridor
cosmetic
cosmetics
cost
costing
costly
costs
costume
costumes
cot
cottage
cotton
cough
coughing
could
couldn't
counsel
count
counted
counter
counter-signed
counters
countries
country
country-sorry
countryside
counts
couple
coupled
coupon
coupons
courage
course
courses
court
courthouse
courts
cover
coverage
covered
covers
cowboy
cowboys
coworkers
crab
crack
cracked
crackers
craft
crafts
cram
cramp
cramped
cramps
crash
crashed
crayfish
crayons
crazy
cream
cream-of-tomato
creams
crease
creased
create
created
credit
crest
crests
crew
crick
crime
crimes
criminal
crisp
crisps
criteria
critic
crock
crockery
crocodile
cross
cross-country
crossing
crosswalk
crow
crow's-feet
crowd
crowded
crude
cruise
cruises
cruising
crunchy
crush
crushed
crutches
cry
cubes
cuffs
cuisine
culprit
cultural
culture
cup
cups
cure
curfew
curio
curious
currencies
currency
current
currently
curry
curtain
curtains
custom
customary
customer
customers
customs
cut
cut-price
cute
cutie
cutlery
cutting
cuttlefish
cx
cycle
cycling
cynical
cysts
d
d'hote
d'oeuvre
d'oeuvres
dad
daily
daintily
daiquiri's
dairy
damage
damaged
dame
damned
dance
dancer
dancing
dandruff
dangerous
dark
dark-brown
dark-colored
darker
darkness
dash
data
date
dates
daughter
daughters
day
day-to-day
daylight
days
dazed
de
de-plane
dead
deadened
deadline
deadly
deaf
deal
dealers
dealing
deals
dear
death
debut
decaffeinated
decayed
deceased
decent
decide
decided
deciding
decision
decisions
deck
declaration
declarations
declare
declaring
decline
decor
decorated
decorating
decreasing
deducted
deep
deeper
deepest
deeply
deerskin
defect
defective
defendant
defer
definitely
degree
degrees
delay
delayed
delectable
delete
deli
delicate
delicious
delight
delighted
delightful
deliver
delivered
delivering
delivers
delivery
deluxe
demand
demonstrating
denominations
density
dent
dental
dentist
denture
dentures
depart
departing
department
departs
departure
depend
dependent
depending
depends
deplane
deposit
deposited
depot
depots
depress
depressed
depression
depth
descend
descent
describe
deserve
design
designated
designed
designer
designers
designs
desired
desk
desks
despise
dessert
desserts
destination
destined
detail
detailed
details
detective
detects
detergent
deteriorated
determined
detest
detestable
detour
develop
developed
developing
development
developments
devices
diabetes
diabetic
diabetics
diagnoses
diagnosis
diagram
dial
dialed
dialing
dialog
diamond
diarrhea
diary
dice
dictionary
did
didn't
die
died
diesel
diet
differ
difference
differences
different
differently
differs
difficult
difficulty
dig
digestible
digestion
digestive
digital
dignitary
dignity
digressing
diluted
dimes
dine
diner
dining
dining-car
dining-room
dinner
dinners
diplomacy
diplomat
diplomatic
dipped
direct
direction
directions
directly
director
directors
directory
dirt
dirty
disabled
disadvantage
disagree
disappear
disappeared
disappointed
disappointing
disappointment
disasters
disc
disco
disconnected
discotheque
discount
discounted
discounts
discouraged
discouraging
discovered
discuss
discussing
discussion
discussions
disease
diseases
disembark
disembarkation
disembarking
dish
dishes
dishwasher
disinfectant
dislike
dislikes
dislocated
dispatch
dispatched
dispensed
display
displayed
displaying
disposable
disposal
dissolved
distance
distant
distinct
distinguished
distress
distressed
distribution
district
disturb
disturbing
ditch
dive
dived
dives
divide
divided
diving
division
divorced
divulge
divvy
dizziness
dizzy
do
doable
docks
doctor
doctors
doctrines
document
documentation
documents
does
doesn't
dog
doggie
doggy
dogs
doing
dokey
doll
dollar
dollar-yen
dollars
dolls
dolphin
dolphins
domestic
dominant
don't
done
donut
donuts
door
doorman
doors
dormitory
dosage
dose
dot
double
double-breasted
double-check
double-decker
doubles
doubt
doughnut
dover
down
downstairs
downtown
dozen
draft
drag
dragging
drain
drained
drama
drank
draw
drawing
dream
dreaming
dreams
dreamy
dress
dressed
dresses
dressing
dressmaker
dressy
dried
drier
drift
drink
drinking
drinks
drive
drive-through
drive-thru
driver
drivers
driving
drop
drop-off
drop-offs
dropoffs
dropped
dropping
drops
drove
drowsy
drug
drugs
drugstore
drunk
drunken
dry
dry-clean
dry-cleaned
dryer
drying
dual
dual-voltage
duck
dude
due
duffed
dull
duplicate
durable
duration
during
dust
dutch
duties
duty
duty-free
dweller
dwellers
dye
dyed
dying
dysentery
e
e-mail
each
eager
eagerly
ear
earache
eardrops
earlier
earliest
early
earn
earned
earning
earphone
earphones
earring
earrings
ears
earthquake
easier
easily
east
east-side
easy
easy-to-shoot
eat
eaten
eating
eau
eau-de-cologne
economic
economical
economically
economy
economy-class
economy-minded
edition
editor
editorial
education
educational
eel
eels
effect
effective
effects
efficiency
effort
efforts
egg
egg-salad
eggplants
eggs
eh
eight
eight-fifteen
eight-o-eight
eight-year-old
eighteen
eighteenth
eighth
eighty
eighty-five
eighty-four
eighty-nine
eighty-seven
either
elastic
elders
election
electric
electrical
electricity
electronic
electronics
elegant
elementary
elevator
eleven
eleven-o-seven
eleventh
else
em
email
embarkation
embarrassed
embassy
embolism
emergencies
emergency
emperor
emphasize
emphasized
employ
employed
employee
employees
employer
employment
employs
empty
emulsifier
en
enamel
enclose
encountering
end
end.
ended
ending
ends
endure
energetic
energy
enervated
enforcement
engage
engaged
engagement
engine
engineer
engineered
engineering
enjoy
enjoyable
enjoyed
enjoying
enjoys
enlarge
enlarged
enlargements
enlarging
enough
enquiring
enrichment
enroll
enrolled
enroute
ensure
enter
entered
entering
entertaining
entertainment
enthusiast
entirely
entitled
entrance
entree
entry
envelope
environment
environmental
envoy
envy
equals
equinox
equipment
equipped
equivalent
er
era
erase
eraser
erotic
err
errand
errands
error
escalator
escort
escorted
escorting
especially
espresso
established
establishing
establishment
establishments
estate
estimate
estimated
etc.
evaluate
evaluating
even
evening
event
events
ever
every
everybody
everyday
everyone
everything
everywhere
ex-baseball
exact
exact-nature
exactly
exam
examination
examine
examined
example
exams
excavated
exceed
excellence
excellent
excellent-good
excellently
except
exception
exceptional
excess
excessive
exchange
exchanged
exchanges
exchanging
excited
exciting
exclude
excludes
excluding
exclusive
excursion
excuse
excused
excuses
executive
exempt
exempted
exemption
exercise
exercises
exhausted
exhausting
exhibit
exhibition
exhibitions
exist
existing
exit
exits
expand
expansive
expect
expectancy
expectations
expected
expecting
expenses
expensive
experience
experienced
experiences
experiencing
expertise
expiration
expire
expiring
expiry
explain
explained
explaining
explanation
explanatory
explode
explore
explosive
export
expose
exposed
exposure
exposures
express
expressed
expression
exquisite
extend
extended
extending
extends
extension
extensive
extra
extracted
extras
extravagant
extremely
eye
eye-lotion
eyebrow
eyebrows
eyes
eyesight
fabric
fabulous
facade
face
face-pack
faces
facial
facilities
facing
facsimile
fact
factory
fail
failed
failure
faint
fainted
fair
fairly
fairway
fall
fallen
falling
falls
false
fame
familiar
families
family
famished
famous
fan
fancy
fanned
fanny
fantastic
far
faraway
fare
fares
farewell
farm
farmer
farsighted
farther
farthest
fascinating
fashion
fashionable
fashions
fast
fast-paced
fasten
fastened
fastening
faster
fastest
fat
father
fatigue
fatigued
fattening
fatty
faucet
fault
faults
favor
favorable
favorite
favorites
fawns
fax
faxes
faxing
feature
features
featuring
fed
fee
feed
feeding
feel
feeling
feelings
feels
fees
feet
fell
fellow
felt
felt-tip
female
feminine
fencing
ferry
fervently
festered
festival
festivals
festive
fetch
fever
feverish
few
fiance
fiancee
fiber
fiction
field
fifteen
fifteen-cent
fifteen-year-old
fifteenth
fifth
fifties
fiftieth
fifty
fifty-cent
fifty-center
fifty-dollar
fifty-eight
fifty-fifty
fifty-five
fifty-four
fifty-four-thirty-three
fifty-nine
fifty-seven
fifty-seventh
fifty-six
fifty-something
fifty-three
fifty-two
fight
figs
figure
figured
figures
file
filing
fill
filled
filling
fillings
film
filmed
films
filter
filthy
fin
final
finally
finals
financial
find
finding
findings
fine
finer
finest
finger
finger-washing
finish
finished
finishes
finishing
fins
fire
fired
fireworks
firm
firmly
first
first-aid
first-base
first-class
first-rate
fish
fish-burger
fish-eye
fishes
fishing
fit
fitness
fits
fitted
fitting
five
five-cent
five-dollar
five-forty-nine
five-o-five
five-one-one
five-place
five-sixty-seven
five-thirty
fives
fix
fixed
fixing
fixings
flag
flagpins
flakes
flamboyant
flame
flamenco
flash
flashes
flashier
flashlight
flashy
flask
flat
flavor
flavored
flavorful
flavors
flaw
flea
fled
flew
flexible
flies
flight
flights
flip
flood
floor
floppy
floss
flourished
flow
flower
flowering
flowers
flowing
flu
fluctuates
fluent
fluently
fluid
flush
flushing
fly
flying
focus
foggy
fold
fold-up
folding
folk
folk-craft
folk-crafts
folkcraft
folks
follow
followed
following
follows
fond
food
foods
fool
fooling
foot
football
for
forbidden
force
forced
forceful
forces
forcibly
forecast
forecourt
foreign
foreigner
foreigners
forever
forget
forgetting
forgive
forgot
forgotten
fork
forks
form
formal
formalities
formally
formed
former
forms
fort
forties
fortnight
fortunate
fortune
forty
forty-first
forty-five
forty-four
forty-fourth
forty-nine
forty-one
forty-second
forty-seven
forty-six
forty-three
forty-two
forward
forwarding
found
foundation
founded
fountain
four
four-and-a-half
four-door
four-thirty
four-way
fourteen
fourteenth
fourth
fragile
fragrance
frame
franc
france
francs
frank
franks
free
free-lance
freedom
freelance
freely
freeway
freezing
french
frenetic
frequency
frequent
frequently
fresh
freshman
fret
fridge
fried
friend
friendly
friends
friendship
fries
frightening
frigid
frills
from
front
frozen
fruit
fruitful
fruits
fry
frying
fuck
fucking
fuel
fugu
full
full-bodied
full-body
full-day
full-grown
full-sized
full-time
fuller
fullness
fully
fun
function
functioning
functions
funds
funeral
funerals
funny
funny-Japanese
fur
furnished
furniture
further
furthest
futile
futon
future
gaining
gains
gallery
gallon
gallons
gallstone
gamble
gambling
game
games
gaming
gander
gap
garage
garden
gardening
gardens
gargle
garlic
garments
gas
gasoline
gastritis
gastroesophageal
gate
gather
gathered
gathering
gathers
gaudy
gauze
gave
gay
gear
geisha
gel
general
generally
generated
generous
genius
gentle
gentleman
gentleman's
gentlemen
gently
genuine
geography
get
get-together
gets
getting
gherkins
giant
gift
gift-wrap
gift-wrapped
gift-wrapping
gifted
gifts
giggling
gim
gin
ginger
girl
girl-friend
girlfriend
girls
give
given
gives
giving
glad
glass
glasses
glimpse
glossy
gloves
glue
go
go-ahead
goal
goatskin
god
gods
goes
going
gold
golf
golfing
gon
gone
good
good-bye
good-it
good-looking
goodness
goods
goodwill
goofed
goofing
goon
gorgeous
gosh
got
gotten
gourmet
government
governor
grab
grabbed
grace
graceful
grades
graduate
graduated
graduates
graduation
grain
grammar
grams
grand
grandfather
grant
granting
grape
grapefruit
grapes
grass
grated
grateful
gratis
gratitude
gratuitous
grave
gravy
gray
graze
grazed
greasy
greasy-looking
great
greatest
greatly
green
greenery
greengrocer
greeting
grey
grill
grill-type
grilled
grim
grip
gripes
gripping
grit
grocery
groggy
grooming
ground
group
groups
grow
grown
growth
guarantee
guaranteed
guard
guards
guess
guessed
guest
guests
guide
guidebook
guidebooks
guided
guides
guiding
guilty
guitar
guitars
gum
gums
gun
gut
guts
guy
guys
gym
gynecologist
gyoza
gypsy
h
ha
habits
had
hadn't
haiku
hail
hair
hair-drier
hair-oil
hair-spray
hair-style
haircut
hairdresser
hairline
hairstyle
hakama
half
half-boiled
half-carafe
half-day
half-ounce
half-price
halfers
halfway
hall
hallmarks
halves
ham
hamburger
hamburgers
hammer
hammock
hand
hand-carry
hand-luggage
hand-made
hand-to-hand
hand-wound
handbag
handbags
handed
handicap
handicapped
handicraft
handicrafts
handing
handkerchief
handle
handles
handling
handmade
hands
handsome
handy
hang
hanger
hangers
hanging
hangout
hangover
haori
happen
happened
happening
happens
happi
happy
harassing
harassment
harbor
hard
hard-boil
hard-boiled
hard-headed
hard-working
harder
hardly
hardware
hare
hares
harm
harsh
harvest
has
hasn't
hassle
hat
hatch
hate
hates
haunted
have
haven't
having
hay
he
head
headache
headaches
headed
heading
headphone
headphones
heads
headset
headsets
headstrong
heal
healing
health
healthiest
healthy
heaps
hear
heard
hearing
heart
heartbeat
heartburn
heat
heated
heater
heating
heavens
heavily
heavy
heel
heeled
heels
held
helicopter
hell
hello
helmet
help
help-wanted
helped
helpful
helpfulness
helping
helps
hem
hen
her
herb
herbal
here
here-people
hereabout
heritage
hers
herself
hesitate
hidden
high
high-end
high-heels
high-priced
high-quality
high-school
high-speed
high-test
higher
higher-level
higher-priced
highest
highlighter
highlights
highly
highway
hike
hiking
hill
hilltop
him
himself
hip
hippyish
hips
hire
hired
his
historic
historical
history
hit
hit-and
hit-and-run
hitched
hits
hitting
hives
hmm
hobbies
hobby
hockey
hoisted
hold
holder
holders
holding
holds
hole
hole-in-the-wall
holes
holiday
holidays
holler
home
homemade
homemaker
homes
homework
honest
honestly
honey
honeydew
honeymoon
honeymooners
honor
honored
hoo
hood
hop
hope
hopeless
hoping
horizon
horn
horrendous
horrible
horrific
horror
hors
horse
horseback
horses
hospital
hospitality
hospitalized
host
hostel
hostels
hostess
hot
hot-dog
hot-water
hotdog
hotdogs
hotel
hotels
hottest
hour
hourly
hours
house
household
housekeeper
housekeeping
houseware
housewares
housewife
housing
how
however
hug
huge
huh
hula-show
humid
hundred
hundreds
hungry
hunk
hurricane
hurricanes
hurry
hurrying
hurt
hurting
hurts
husband
hut
hygiene
i
ice
ice-cream
iceberg
iced
idea
ideal
ideas
identical
identification
identified
identify
identifying
idiot
idyllic
if
ignore
ikebana
ill
illegally
illness
illnesses
illustrate
illustrated
illustration
imagine
imagined
immediate
immediately
immensely
immerse
immigration
immunization
immunizations
immunized
imperative
implemented
implied
impolite
import
import-export
importance
important
importantly
imported
imposed
impossible
impressed
impression
impressions
impressive
improper
improve
improved
improvement
improving
impulse
in
in-between
in-flight
in-movie
incapable
incense
inch
inches
inclined
include
included
includes
including
income
incomes
incomplete
inconvenience
inconveniences
inconveniencing
inconvenient
incorrect
incorrectly
increase
increased
increases
increasing
incredible
indebted
indeed
indemnify
independent
index
indicate
indicating
indicator
indigestion
individual
individually
indoor
indulge
industries
industrious
industry
inexpensive
infant
infected
infection
infield
inflamed
inflammation
inflation
inflexible
influenza
info
inform
information
informative
informed
ingredient
ingredients
initial
initials
initiatives
inject
injection
injections
injured
injury
ink
inn
inner
inner-city
innings
inns
inoculate
inoculation
inoculations
input
inquire
inquires
inquiries
inquiring
inquiry
insane
insect
insert
inserted
inside
insist
insoles
insomnia
inspect
inspected
inspection
inspiring
install
instance
instant
instantly
instead
instep
institution
instructed
instruction
instructions
instructor
instructors
instruments
insurance
insure
insured
insuring
intelligent
intend
intended
intending
intense
intensity
intent
intention
intercourse
interest
interested
interesting
interests
interim
interject
intermission
intermissions
international
internationally
internationally-known
internet
internists
interpret
interpreter
interrupt
interrupted
interrupting
intersection
interval
intervals
intestines
into
intoxicated
introduce
introduced
introduces
introduction
introductory
invalid
invalidate
invalidated
inventory
investigate
investigating
investment
invitation
invite
invited
inviting
invoice
invoices
involved
iron
ironed
irrelevant
irritate
irritation
is
island
islands
isn't
issue
issued
issues
it
italics
itchy
item
itemized
items
itinerary
its
itself
jack
jacket
jackets
jacuzzi
jail
jam
jammed
jar
jasmine
jaundice
jaw
jazz
jazz-lover
jeans
jelly
jellyfish
jerry
jet
jewelry
jigsaw
jingle
job
jobless
jobs
jogging
join
joined
joining
joint
joints
joke
joking
jot
journalism
journey
journeyed
journeying
journeys
joy
judging
judgment
juice
juices
jumbo
jump
jumper
junior
just
just-add-water
kadomatsu
kangaroo
kangaroos
karat
karate
karma
keen
keep
keeping
keeps
keepsake
ken
kept
ketchup
kettle
key
key-rings
keys
kick
kicks
kid
kidding
kids
kill
killer
killers
killing
kilogram
kilograms
kilometer
kilometers
kilos
kimono
kimura
kind
kindergarten
kindly
kindness
kinds
kipper
kit
kitchen
kitchenette
kitchenettes
kitchens
kite
kits
knee
knees
knew
knife
knives
knock
knocked
know
knowing
knowledge
known
knows
la
label
labels
labor
laborers
ladies
lady
lag
lager
lake
lamb
lamp
land
landing
landlord
landmark
landmarks
landscape
landscaper
lane
language
languages
languid
lantern
lap
lapels
large
large-size
large-sized
larger
larges
largest
last
lasted
late
lately
later
latest
latest-fashioned
latte
latter
laughing
launder
laundered
launderette
laundry
lavatory
law
lawned
laxative
lay
laying
lazy
lead
leaded
leader
leading
leads
leaflet
league
leaking
leaks
lean
learn
learned
learning
learnt
lease
least
leather
leave
leaves
leaving
lecture
lectures
left
left-hand
left-handle
left-over
leftover
leftovers
leg
legal
legislative
legs
lemon
lemonade
lend
lending
length
lengthen
lengthened
lengthy
lens
lenses
leotard
less
lesson
lessons
let
letdown
lethargic
lets
letter
letter-paper
letterhead
letters
letting
lettuce
level
levied
liability
liaison
liberated
library
license
licenses
lie
lie-down
lies
life
life-long
lifeguard
lifeless
lifestyle
lifetime
lift
lifted
lifting
light
light-headed
lighter
lighting
lightly
lights
like
liked
likely
liking
limit
limited
limits
limo
limousine
limousines
limp
line
linen
liner
lines
linguine
link
lip
lips
lipstick
lipsticks
liquid
liquor
lire
list
listed
listen
listening
listings
listless
lists
lit
liter
literature
liters
litres
little
live
lived
lively
liver
lives
living
living-room
load
loaded
loading
loads
loaf
loafers
loan
loathe
lobby
lobster
local
locally
locals
locate
located
locating
location
locations
lock
locked
locker
lockers
locks
lodge
lodging
lodgings
lonely
long
long-distance
long-term
longer
longest
look
looked
looker
looking
looks
loose
lose
loses
losing
loss
lost
lost-and-found
lot
lotion
lotions
lots
lottery
loud
louder
loudly
lounge
love
loved
lovely
lover
loves
low
low-alcohol
low-cal
low-calorie
lower
lowered
lowering
lowest
loyal
lozenges
luck
lucky
lug
luggage
lump
lumps
lunar
lunch
luster
luxurious
luxury
lying
lymph
ma'am
macaroons
machine
machine-made
machine-wash
machine-washed
machines
mad
madam
madame
made
magazine
magazines
magic
magnificent
magnifying
maid
mail
mailbox
mailboxes
mailed
mailing
main
mainly
maintain
maintained
maintenance
major
majored
majoring
majority
make
make-over
make-up
maker
makes
makeup
making
male
males
mall
man
manage
managed
management
manager
managerial
managing
manicure
manner
manners
